In [1]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
names=['Ramesh','suresh','mallesh']
age=[20,22,24]
n=pd.DataFrame(zip(names,age))

In [8]:
df=pd.DataFrame()

In [9]:
df['names']=['ameen','niraj','mubeen']
df['age']=[20,21,22]

In [11]:
df

    names  age
0   ameen   20
1   niraj   21
2  mubeen   22

In [13]:
df.shape

(3, 2)

In [ ]:
df.size